#### 📖 Terraform Plan ('src/common/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_continua: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.fims_op_app: Still reading... [10s elapsed]
data.azurerm_linux_function_app.app_messages_xl[0]: Still reading... [10s elapsed]
data.azurerm_linux_function_app.app_messages_xl[1]: Still reading... [10s elapsed]
data.azurerm_linux_function_app.wallet_user: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_cgn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_continua: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.fims_op_app: Still reading... [20s elapsed]
data.azurerm_linux_function_app.app_messages_xl[0]: Still reading... [20s elapsed]
data.azurerm_linux_function_app.app_messages_xl[1]: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_03: Still reading... [10s elapsed]
data.azurerm_linux_function_app.wallet_user: Still reading... [20s elapsed]
data.azurerm_linux_function_app.function_cgn: Still reading... [20s elapsed]
data.azurerm_linux_function_app.function_assets_cdn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_sign_user: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_04: Still reading... [10s elapsed]
data.azurerm_linux_web_app.firmaconio_selfcare_web_app: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_03: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_selfcare_be: Still reading... [10s elapsed]
data.azurerm_linux_function_app.lollipop_function: Still reading... [10s elapsed]
data.azurerm_linux_function_app.eucovidcert: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_sign_user: Still reading... [20s elapsed]
data.azurerm_linux_function_app.function_profile[1]: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_04: Still reading... [20s elapsed]
data.azurerm_linux_function_app.function_profile[0]: Still reading... [10s elapsed]
data.azurerm_linux_web_app.firmaconio_selfcare_web_app: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_selfcare_be: Still reading... [20s elapsed]
data.azurerm_linux_function_app.services_app_backend_function_app: Still reading... [10s elapsed]
data.azurerm_linux_function_app.lollipop_function: Still reading... [20s elapsed]
data.azurerm_linux_function_app.eucovidcert: Still reading... [20s elapsed]
data.azurerm_linux_function_app.function_profile[1]: Still reading... [20s elapsed]
data.azurerm_linux_function_app.function_profile[0]: Still reading... [20s elapsed]
data.azurerm_linux_function_app.services_app_backend_function_app: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "api_app" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-waf-appgateway-api-app-policy"
        name                = "io-p-waf-appgateway-api-app-policy"
        tags                = {
            "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"   = "Terraform"
            "Environment" = "Prod"
            "Owner"       = "IO"
            "Source"      = "https://github.com/pagopa/io-infra"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.monitoring_weu.azurerm_application_insights_standard_web_test.web_tests["CIE"] will be destroyed
  # (because key ["CIE"] is not in for_each map)
  - resource "azurerm_application_insights_standard_web_test" "web_tests" {
      - application_insights_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common" -> null
      - enabled                 = true -> null
      - frequency               = 900 -> null
      - geo_locations           = [
          - "emea-nl-ams-azr",
        ] -> null
      - id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/webTests/CIE-test-io-p-ai-common" -> null
      - location                = "westeurope" -> null
      - name                    = "CIE-test-io-p-ai-common" -> null
      - resource_group_name     = "io-p-rg-common" -> null
      - retry_enabled           = true -> null
      - synthetic_monitor_id    = "CIE-test-io-p-ai-common" -> null
      - tags                    = {} -> null
      - timeout                 = 30 -> null
        # (1 unchanged attribute hidden)

      - request {
          - follow_redirects_enabled         = false -> null
          - http_verb                        = "GET" -> null
          - parse_dependent_requests_enabled = false -> null
          - url                              = "https://app-backend.io.italia.it/login?authLevel=SpidL2&entityID=xx_servizicie" -> null
            # (1 unchanged attribute hidden)
        }

      - validation_rules {
          - expected_status_code        = 200 -> null
          - ssl_cert_remaining_lifetime = 1 -> null
          - ssl_check_enabled           = true -> null
        }
    }

  # module.monitoring_weu.azurerm_application_insights_standard_web_test.web_tests["CIE L2"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common"
      + enabled                 = true
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "westeurope"
      + name                    = "CIE L2-test-io-p-ai-common"
      + resource_group_name     = "io-p-rg-common"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://app-backend.io.italia.it/login?authLevel=SpidL2&entityID=xx_servizicie"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 1
          + ssl_check_enabled           = true
        }
    }

  # module.monitoring_weu.azurerm_application_insights_standard_web_test.web_tests["CIE L3"] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common"
      + enabled                 = true
      + frequency               = 900
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "westeurope"
      + name                    = "CIE L3-test-io-p-ai-common"
      + resource_group_name     = "io-p-rg-common"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = "https://app-backend.io.italia.it/login?authLevel=SpidL3&entityID=xx_servizicie"
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 1
          + ssl_check_enabled           = true
        }
    }

  # module.monitoring_weu.azurerm_monitor_metric_alert.metric_alerts["CIE"] will be destroyed
  # (because key ["CIE"] is not in for_each map)
  - resource "azurerm_monitor_metric_alert" "metric_alerts" {
      - auto_mitigate            = false -> null
      - description              = "Web availability check alert triggered when it fails. Runbook: https://pagopa.atlassian.net/wiki/spaces/IC/pages/762347521/Web+Availability+Test+-+TLS+Probe+Check" -> null
      - enabled                  = true -> null
      - frequency                = "PT1M" -> null
      - id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/metricAlerts/CIE-test-io-p-ai-common" -> null
      - name                     = "CIE-test-io-p-ai-common" -> null
      - resource_group_name      = "io-p-rg-common" -> null
      - scopes                   = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common",
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/webTests/CIE-test-io-p-ai-common",
        ] -> null
      - severity                 = 1 -> null
      - tags                     = {} -> null
      - window_size              = "PT5M" -> null
        # (2 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror" -> null
          - webhook_properties = {} -> null
        }

      - application_insights_web_test_location_availability_criteria {
          - component_id          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common" -> null
          - failed_location_count = 1 -> null
          - web_test_id           = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/webTests/CIE-test-io-p-ai-common" -> null
        }
    }

  # module.monitoring_weu.azurerm_monitor_metric_alert.metric_alerts["CIE L2"] will be created
  + resource "azurerm_monitor_metric_alert" "metric_alerts" {
      + auto_mitigate            = false
      + description              = "Web availability check alert triggered when it fails. Runbook: https://pagopa.atlassian.net/wiki/spaces/IC/pages/762347521/Web+Availability+Test+-+TLS+Probe+Check"
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "CIE L2-test-io-p-ai-common"
      + resource_group_name      = "io-p-rg-common"
      + scopes                   = (known after apply)
      + severity                 = 1
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + application_insights_web_test_location_availability_criteria {
          + component_id          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common"
          + failed_location_count = 1
          + web_test_id           = (known after apply)
        }
    }

  # module.monitoring_weu.azurerm_monitor_metric_alert.metric_alerts["CIE L3"] will be created
  + resource "azurerm_monitor_metric_alert" "metric_alerts" {
      + auto_mitigate            = false
      + description              = "Web availability check alert triggered when it fails. Runbook: https://pagopa.atlassian.net/wiki/spaces/IC/pages/762347521/Web+Availability+Test+-+TLS+Probe+Check"
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "CIE L3-test-io-p-ai-common"
      + resource_group_name      = "io-p-rg-common"
      + scopes                   = (known after apply)
      + severity                 = 1
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + application_insights_web_test_location_availability_criteria {
          + component_id          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common"
          + failed_location_count = 1
          + web_test_id           = (known after apply)
        }
    }

Plan: 4 to add, 1 to change, 2 to destroy.

Warning: Argument is deprecated

  with module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app,
  on ../_modules/application_gateway/firewall.tf line 61, in resource "azurerm_web_application_firewall_policy" "api_app":
  61:         rule_group_name = "REQUEST-942-APPLICATION-ATTACK-SQLI"

`disabled_rules` will be removed in favour of the `rule` property in version
4.0 of the AzureRM Provider.

(and 50 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
